In [2]:
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [3]:
titles = pd.read_csv('data/titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [4]:
cast = pd.read_csv('data/cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### Using groupby(), count the number of films that have been released in each decade in the history of cinema.

In [6]:
titles.groupby(titles["year"] // 10 * 10).count()

      title   year
year
1890      3      3
1900     37     37
1910   6512   6512
1920   8797   8797
1930  10097  10097
1940   8576   8576
1950  12711  12711
1960  17515  17515
1970  18714  18714
1980  20243  20243
1990  22225  22225
2000  38713  38713
2010  67977  67977
2020    210    210

### Use groupby() count the number of "Hamlet" films made in each decade.

In [10]:
titles[titles["title"].eq("Hamlet")].groupby(titles["year"] // 10 * 10).size()

year
1910    3
1920    1
1940    1
1950    1
1960    2
1970    2
1980    1
1990    2
2000    2
2010    3
dtype: int64

### How many leading (n=1) roles were available to actors, and how many to actresses, in each year of the 1950s?

In [14]:
cast[cast["n"].eq(1) & (cast["year"] // 10 * 10).eq(1950)].groupby(["year", "type"]).size()

year  type
1950  actor      626
      actress    281
1951  actor      647
      actress    281
1952  actor      607
      actress    293
1953  actor      652
      actress    301
1954  actor      634
      actress    310
1955  actor      641
      actress    281
1956  actor      643
      actress    305
1957  actor      735
      actress    301
1958  actor      710
      actress    295
1959  actor      721
      actress    317
dtype: int64

### In the 1950s taken as a whole, how many total roles were available to actors, and how many to actresses, for each "n" number 1 through 5?

In [20]:
cast[(cast["year"] // 10 * 10).eq(1950) & cast["n"].le(5)].groupby(["type", "n"]).size()

type     n
actor    1.0    6616
         2.0    4564
         3.0    5587
         4.0    5594
         5.0    5611
actress  1.0    2965
         2.0    4556
         3.0    3148
         4.0    2849
         5.0    2544
dtype: int64

### Use groupby() to determine how many roles are listed for each of the Pink Panther movies.

In [33]:
cast[cast["title"].str.contains("Pink Panther")].groupby(["title", "year"]).size().sort_index(level=1)

title                           year
The Pink Panther                1963    21
The Return of the Pink Panther  1975    30
The Pink Panther Strikes Again  1976    68
Revenge of the Pink Panther     1978    64
Trail of the Pink Panther       1982    41
Curse of the Pink Panther       1983    67
Son of the Pink Panther         1993    46
The Pink Panther                2006    90
The Pink Panther 2              2009    84
dtype: int64

### List, in order by year, each of the films in which Frank Oz has played more than 1 role.

In [45]:
frank_oz_count = cast[cast["name"].eq("Frank Oz")][["title","year","character"]].sort_values("year").groupby(["title","year"]).size()
frank_oz_count

title                                           year
An American Werewolf in London                  1981    2
Blues Brothers 2000                             1998    1
Follow That Bird                                1985    3
Innocent Blood                                  1992    1
Inside Out                                      2015    1
Labyrinth                                       1986    1
Monsters, Inc.                                  2001    1
Muppet Treasure Island                          1996    4
Muppets from Space                              1999    4
Spies Like Us                                   1985    1
Star Wars: Episode I - The Phantom Menace       1999    1
Star Wars: Episode II - Attack of the Clones    2002    1
Star Wars: Episode III - Revenge of the Sith    2005    1
Star Wars: Episode V - The Empire Strikes Back  1980    1
Star Wars: Episode VI - Return of the Jedi      1983    1
Star Wars: Episode VII - The Force Awakens      2015    1
Superman III                                    1983    1
The Adventures of Elmo in Grouchland            1999    3
The Blues Brothers                              1980    1
The Dark Crystal                                1982    2
The Great Muppet Caper                          1981    6
The Muppet Christmas Carol                      1992    7
The Muppet Movie                                1979    8
The Muppets Take Manhattan                      1984    7
Trading Places                                  1983    1
Zathura: A Space Adventure                      2005    1
dtype: int64

In [47]:
frank_oz_count[frank_oz_count.gt(1)].sort_index(level=1)

title                                 year
The Muppet Movie                      1979    8
An American Werewolf in London        1981    2
The Great Muppet Caper                1981    6
The Dark Crystal                      1982    2
The Muppets Take Manhattan            1984    7
Follow That Bird                      1985    3
The Muppet Christmas Carol            1992    7
Muppet Treasure Island                1996    4
Muppets from Space                    1999    4
The Adventures of Elmo in Grouchland  1999    3
dtype: int64

### List each of the characters that Frank Oz has portrayed at least twice.

In [55]:
frank_oz_chars = cast[cast["name"].eq("Frank Oz")].groupby("character").size().sort_values(ascending=False)
frank_oz_chars[frank_oz_chars.gt(1)]

character
Animal            6
Miss Piggy        6
Yoda              6
Sam the Eagle     5
Fozzie Bear       4
Cookie Monster    3
Bert              3
Grover            2
dtype: int64